brew "gcc" if OS.linux?

# System-level (linked libraries or complex deps)
brew "coreutils"
brew "curl"
brew "git"
brew "gnupg"
brew "libyaml"
brew "mise"
brew "neovim"
brew "tmux"

if OS.mac?
  tap "FelixKratz/formulae"
  brew "pinentry-mac"
  brew "sketchybar"
  cask "1password-cli"
  cask "font-hack-nerd-font"
  cask "font-jetbrains-mono-nerd-font"
  cask "ghostty"
  cask "nikitabobko/tap/aerospace"
end
