brew "gcc" if OS.linux?

brew "bat"
brew "coreutils"
brew "curl"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "lazygit"
brew "libyaml"
brew "mise"
brew "neovim"
brew "overmind"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "uv"
brew "zoxide"

if OS.mac?
  tap "FelixKratz/formulae"
  brew "pinentry-mac"
  brew "sketchybar"
  cask "1password-cli"
  cask "font-hack-nerd-font"
  cask "font-jetbrains-mono-nerd-font"
  cask "ghostty"
  cask "nikitabobko/tap/aerospace"
end
