brew "bat"
brew "coreutils"
brew "curl"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "lazygit"
brew "libyaml"
brew "mise"
brew "neovim"
brew "overmind"
brew "pinentry-mac"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "zoxide"
cask "1password-cli"
cask "ghostty"
